combat-quarkus-vs-spring/springboot-echo/src/main/taurus/script_taurus_springboot-echo.yaml
execution:
- concurrency: 5
  ramp-up: 20s
  hold-for: 2m
  scenario: Simple
 

#scenarios:
#  Simple :
#    default-address: "https://www.wordreference.com"
#    requests: 
#      - label: "/definicion/ocurre"
#        url: "/definicion/ocurre"
#        method: GET

scenarios:
  Simple :
    default-address: "http://${HOST_DOCKER_IP}:8082"
    requests: 
      - label: "Spring Boot Echo"
        url: "/echo/ualter"
        method: GET